In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [4]:
obj = Series([4, 7, -5, 3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3])

In [7]:
obj.keys

<bound method Series.keys of 0    4
1    7
2   -5
3    3
dtype: int64>

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
DataFrame(obj2)[1]=0

In [13]:
obj2[obj2<0]

a   -5
dtype: int64

In [14]:
7 in obj2

False

In [15]:
sdata={'a':{'a':'Bonjour','b':'Bonsoir','c':'Nous sommes à midi'},'b':'IFRI','c':'FSA','d':'EPAC','e':'MasterCard'}

In [16]:
sdata

{'a': {'a': 'Bonjour', 'b': 'Bonsoir', 'c': 'Nous sommes à midi'},
 'b': 'IFRI',
 'c': 'FSA',
 'd': 'EPAC',
 'e': 'MasterCard'}

In [17]:
dtf=DataFrame(sdata)

In [18]:
dtf['b'][1]='Licence 1'

In [19]:
dtf

                    a          b    c     d           e
a             Bonjour       IFRI  FSA  EPAC  MasterCard
b             Bonsoir  Licence 1  FSA  EPAC  MasterCard
c  Nous sommes à midi       IFRI  FSA  EPAC  MasterCard

In [20]:
dtf['b']['d']='Licence 1'

In [21]:
dtf

                    a          b    c     d           e
a             Bonjour       IFRI  FSA  EPAC  MasterCard
b             Bonsoir  Licence 1  FSA  EPAC  MasterCard
c  Nous sommes à midi       IFRI  FSA  EPAC  MasterCard

In [22]:
obj3 = Series(sdata)

In [23]:
obj3

a    {'a': 'Bonjour', 'b': 'Bonsoir', 'c': 'Nous so...
b                                                 IFRI
c                                                  FSA
d                                                 EPAC
e                                           MasterCard
dtype: object

In [24]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [25]:
obj4 = Series(sdata, index=states)

In [26]:
obj4

California    NaN
Ohio          NaN
Oregon        NaN
Texas         NaN
dtype: object

In [27]:
sdata['California']=12

In [28]:
obj4 = Series(sdata, index=states)

In [29]:
obj4

California     12
Ohio          NaN
Oregon        NaN
Texas         NaN
dtype: object

In [30]:
obj4.name = 'population'

In [31]:
obj4

California     12
Ohio          NaN
Oregon        NaN
Texas         NaN
Name: population, dtype: object

In [32]:
obj4

California     12
Ohio          NaN
Oregon        NaN
Texas         NaN
Name: population, dtype: object

In [33]:
obj4.index=['r','s','t','u']

In [34]:
obj4

r     12
s    NaN
t    NaN
u    NaN
Name: population, dtype: object

In [35]:
obj4.index

Index(['r', 's', 't', 'u'], dtype='object')

In [36]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [37]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [38]:
frame=DataFrame(data,index=['a','b','c','d','e'])

In [39]:
frame

    state  year  pop
a    Ohio  2000  1.5
b    Ohio  2001  1.7
c    Ohio  2002  3.6
d  Nevada  2001  2.4
e  Nevada  2002  2.9

In [40]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],

index=['one', 'two', 'three', 'four', 'five'])

In [41]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [42]:
frame2['pop']

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: pop, dtype: float64

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2['debt'] = 16.5

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [46]:
frame2['debt'] = np.arange(5)

In [47]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [48]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [49]:
frame2['debt']=val

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [51]:
frame2['eastern'] = frame2.state

In [52]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    Ohio
two    2001    Ohio  1.7  -1.2    Ohio
three  2002    Ohio  3.6   NaN    Ohio
four   2001  Nevada  2.4  -1.5  Nevada
five   2002  Nevada  2.9  -1.7  Nevada

In [53]:
frame2['eastern'] = frame2.state == 'Ohio'

In [54]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [55]:
del frame2['eastern']

In [56]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [57]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},

'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [58]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [59]:
DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [60]:
frame2.T

        one   two three    four    five
year   2000  2001  2002    2001    2002
state  Ohio  Ohio  Ohio  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9
debt    NaN  -1.2   NaN    -1.5    -1.7

In [61]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [62]:
pdata = {'Ohio': frame3['Ohio'][:-1],
'Nevada': frame3['Nevada'][:2]}

NameError: name 'frame3' is not defined

In [ ]:
frame2.values

In [ ]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [ ]:
obj

In [ ]:
obj.index

In [ ]:
frame3=frame2

In [ ]:
frame3

In [ ]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [ ]:
obj

In [ ]:
obj.reindex(['a', 'b', 'c', 'd', 'e','e','f'], fill_value=7)

In [ ]:
obj.reindex(['a'], fill_value=0)

In [ ]:
obj

In [ ]:
obj3 = Series(['blue', 'purple', 'yellow','oui'], index=np.arange(0,8,2))

In [ ]:
obj3

In [ ]:
Frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],

columns=['Ohio', 'Texas', 'California'])

In [ ]:
Frame

In [ ]:
Frame.reindex(['a','b','c','d','e'])

##REindexons le Dataframe

In [ ]:
Frame.reindex(['a','b','c','d','e'],columns=['IFRI','EPAC','ERSE'])

In [ ]:
Frame.append(['Nous sommes','Vous êtes','Voilà','presque','fin'])

In [ ]:
Frame

In [ ]:
Frame

In [ ]:
Frame.append(['Nous sommes','Vous êtes','Voilà','presque','fin'])

In [ ]:
Frame.append([2,45,'FIn'])

In [ ]:
Frame

In [ ]:
Frame

In [ ]:
Frame2.drop('a')

In [ ]:
Frame

In [ ]:
Frame.index

In [ ]:
Frame.drop('a')

In [ ]:
data = DataFrame(np.arange(16).reshape((4, 4)),

index=['Ohio', 'Colorado', 'Utah', 'New York'],

columns=['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
data['one']

In [ ]:
data['two']['Ohio']

In [ ]:
data = DataFrame(np.arange(16).reshape((4, 4)),

index=['Ohio', 'Colorado', 'Utah', 'New York'],

columns=['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [ ]:
obj=DataFrame(obj)

In [ ]:
obj

In [ ]:
obj.reindex(np.arange(5))

In [ ]:
obj.drop('a')

In [ ]:
obj[:2]

In [ ]:
obj['a':'b']

In [ ]:
obj['d':]

In [ ]:
data

In [ ]:
data[data>=10]

In [ ]:
data

In [ ]:
data.ix[data.three > 5, :3]

In [ ]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [ ]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [ ]:
s1+s2

In [ ]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),

index=['Ohio', 'Texas', 'Colorado'])

In [ ]:
df1

In [ ]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
df2

In [ ]:
df1+df2

In [ ]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [ ]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [ ]:
df1+df2

In [ ]:
df1.reindex(columns=df2.columns,fill_value=1)

In [ ]:
df1

In [ ]:
df1.add(df2,fill_value=2)

In [ ]:
df1.add(df2,fill_value=np.arange(4))

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.add(df2,fill_value=1)

In [ ]:
df1.sub(df2,fill_value=1)

In [ ]:
df2.div(df1,fill_value=1)

In [ ]:
mul=df1.mul(df2,fill_value=2)

In [ ]:
mul

In [ ]:
list(df2['b'])

In [ ]:
sous=df2-df2['b']

In [ ]:
sous

In [ ]:

series2 = Series(range(3), index=['b', 'e', 'f'])

In [ ]:
series2

In [ ]:
frame

In [ ]:
frame-series2

In [ ]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [ ]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
frame-series2

In [ ]:
frame+series2

In [ ]:
series3=frame['d']

In [ ]:
series3

In [ ]:
frame

In [ ]:
frame.sub(series3,axis=0)

In [ ]:
frame.add(series3,axis=0)

In [ ]:
frame.div(series3,axis=0)

In [ ]:
frame.mul(series3,axis=0)

In [ ]:
frame=DataFrame(np.random.randn(4,3),columns=list('ade'),index=['Utah','Ohio','Texas','Oregon'])

In [ ]:
frame

In [ ]:
f = C x: x.max() - x.min()

In [ ]:
!C??

In [ ]:
!lambda?all

In [ ]:
!lambda

In [ ]:
f

In [ ]:
frame.apply(f)

In [ ]:
da=DataFrame(np.arange(1,10).reshape(3,3),index=list('abc'),columns=['c1','c2','c3'])

In [ ]:
da

In [ ]:
def f(x):
    return Series([x.min(),x.max()], index=['min', 'max'])

In [ ]:
da.apply(f)

In [ ]:
format = lambda x: '%.2f' % x

In [ ]:
frame

In [ ]:
frame.applymap(format)

In [ ]:
frame['d'].map(format)

## Sorting and Ranking

In [ ]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],

columns=['d', 'a', 'b', 'c'])

In [ ]:
frame.sort_index()

In [ ]:
frame

In [ ]:
frame

In [ ]:
frame.sort_index()

In [ ]:
frame['d'].order()

In [ ]:
frame.sort_index()

frame

In [ ]:
frame.sort_index(axis=1)

In [ ]:
frame.sort_index(axis=0)

## Trie par Ordre  decroissant selon l'axe des ordonées

In [ ]:
frame.sort_index(axis=1,ascending=False)

## Trie par Ordre decroissant selon l'axe des abscisses

In [ ]:
frame.sort_index(axis=0,ascending=False)

In [ ]:
obj = Series([4, 7, -3, 2])

In [ ]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [ ]:
obj.order()

## <font color='red'>ICi ça ne marche pas !! Pourquoi ?? </font>

In [ ]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [ ]:
frame

In [ ]:
frame.sort_index(by='b')

In [ ]:
frame.sort_index(by=['a', 'b'])

In [ ]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [ ]:
obj

In [ ]:
obj.rank()

In [ ]:
obj.rank(method='first')

In [ ]:
obj.rank()

In [ ]:
frame

In [ ]:
import pandas as pd

In [ ]:
from pandas import Series, DataFrame

In [ ]:
frame2

In [ ]:
frame

In [ ]:
frame.reindex(['a','f','t','y','p'])

In [ ]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [ ]:
frame

In [ ]:
frame.sort_index(by='b')

In [ ]:
frame.sort_index(by=['a', 'b'])

In [ ]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [ ]:
obj.rank()

In [ ]:
frame

In [ ]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],

'c': [-2, 5, 8, -2.5]})

In [ ]:
frame

In [ ]:
frame.rank(axis=1)

In [ ]:
frame['e'].map(format)

In [ ]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [ ]:
obj.sort_index()

In [ ]:
frame.sort_index(axis=1, ascending=False)

In [ ]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],

[np.nan, np.nan], [0.75, -1.3]],

index=['a', 'b', 'c', 'd'],
columns=['one', 'two'])

In [ ]:
df

In [ ]:
df.sum()

In [ ]:
df.mean(axis=1, skipna=False)

In [ ]:
df.cumsum()

In [ ]:
df.describe()

In [ ]:
df

In [ ]:
df.index=['t','g','b','i']

In [ ]:
df

In [ ]:
df.idxmin()

In [ ]:
obj

In [ ]:
obj.reindex??

In [ ]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
frame

In [ ]:
df1=frame

In [ ]:
df1

In [ ]:
df2=df1

In [ ]:
df2

In [ ]:
df2.drop('b')

In [ ]:
del df2['b']

In [ ]:
df2

In [ ]:
df2.reindex(columns=df1.columns, fill_value=0)

In [ ]:
df2

In [ ]:
df2['d']

In [ ]:
df2

In [ ]:
obj

In [ ]:
obj.drop('c')

In [ ]:
obj

In [ ]:
obj.drop(['a','b'])

In [ ]:
obj

In [ ]:
data = DataFrame(np.arange(16).reshape((4, 4)),

index=['Ohio', 'Colorado', 'Utah', 'New York'],

columns=['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [ ]:
obj[1]

In [ ]:
obj['b']

In [ ]:
obj[[1, 3]]

In [ ]:
obj[obj < 2]

In [ ]:
data

In [ ]:
data[data['three']]

In [ ]:
data[['three', 'one']]

In [ ]:
data[:2]

In [ ]:
data.loc?

In [ ]:
 data.loc['Utah','one']=-9

In [ ]:
data

In [ ]:
data.iloc[1]

In [ ]:
data.loc[['Colorado'],['two','three']]

In [ ]:
data.iloc[[1],[1,2,3
              ]]

In [ ]:
data.iloc[[2]]

In [ ]:
data.loc[:'Utah', ['two']]

In [ ]:
data.loc[data.three>5,:'three']

In [ ]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [ ]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [ ]:
s1

In [ ]:
s2

In [ ]:
s1+s2

In [ ]:
s3=s1+s2

In [ ]:
s3

In [ ]:
s3.fillna(7,inplace=True)

In [ ]:
s3

## <font color='red'>s3.fillna(7,inplace=True)</font>

In [ ]:
s3.fillna(7,inplace=True)

In [ ]:
f1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),

index=['Ohio', 'Texas', 'Colorado'])

In [ ]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
df3=(df1+df2)

In [ ]:
df3

In [ ]:
df3.fillna(4,inplace=True)

In [ ]:
df3

In [ ]:
import string

In [ ]:
string.ascii_letters

import string

In [ ]:
string.ascii_uppercase

In [ ]:
df1+df2

In [ ]:
f1.reindex(columns=df2.columns, fill_value=0)

In [ ]:
arr = np.arange(12.).reshape((3, 4))

In [ ]:
arr

In [ ]:
DataFrame(arr)

In [ ]:
arr[0]

In [ ]:
arr-arr[0]

In [ ]:
arr-[5]

In [ ]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
frame

In [ ]:
series=frame.iloc[0]

In [ ]:
frame

In [ ]:
series=frame.iloc[0]

In [ ]:
series

In [ ]:
frame-series

In [ ]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [ ]:
series

In [ ]:
frame+series2

In [ ]:
series3 = frame['d']

In [ ]:
frame-series3

In [ ]:
frame.sub(series,axis=0)

In [ ]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
frame

In [ ]:
np.abs(frame)

In [ ]:
In [164]: def f(x):

    return Series([x.min(), x.max()], index=['min', 'max'])

In [ ]:
frame.apply(f)

In [ ]:
frame.applymap(format)

In [ ]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),

index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
f = lambda x: x.max() - x.min()

In [ ]:
frame.apply(f)

In [ ]:
frame.applymap(f)

In [ ]:
format = lambda x: '%.2f' % x

In [ ]:
frame.applymap(format)

In [ ]:
frame['e'].map(format)

In [ ]:
obj = Series([4, 7, -3, 2])

In [ ]:
obj.sort_values()

In [ ]:
frame

In [ ]:
frame.groupby('b')?

In [ ]:
a

In [ ]:
frame.groupby('b').count()

In [ ]:
frame.groupby

In [ ]:
frame

In [ ]:
frame.groupby('e').sum()

In [ ]:
frame.groupby(by="e", dropna=False).sum()

In [ ]:
obj.rank(method='first')

In [ ]:
obj

In [ ]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [ ]:
obj

In [ ]:
obj.rank()

In [ ]:
obj.rank()?

In [ ]:
obj['c']

## Summarizing and Computing Descriptive Statistics

In [ ]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
.....:
[np.nan, np.nan], [0.75, -1.3]],
.....:
index=['a', 'b', 'c', 'd'],
.....:
columns=['one', 'two'])

In [ ]:
df

In [ ]:
df.sum()

In [ ]:
df.sum(axis=1)

In [ ]:
df.mean(axis=1,skipna=False)

In [ ]:
df.idxmax()

In [ ]:
df.cumsum()

In [ ]:
df.describe()

In [ ]:
df.describe().head(3)

In [ ]:
df.info()

In [ ]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [ ]:
obj.info()

In [ ]:
obj.info()

In [63]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [65]:
obj.info()

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 160.0 bytes

In [67]:
df

NameError: name 'df' is not defined

In [69]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],

[np.nan, np.nan], [0.75, -1.3]],

index=['a', 'b', 'c', 'd

SyntaxError: EOL while scanning string literal (2353008463.py, line 5)

In [70]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [71]:
DataFrame(data)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [76]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [77]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [78]:
uniques = obj.unique()

In [79]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [80]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [81]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [83]:
mask = obj.isin(['b', 'c'])

In [84]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [85]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],

'Qu2': [2, 3, 1, 2, 3],

'Qu3': [1, 5, 2, 4, 4]})

In [86]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [87]:
data.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [91]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [92]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [93]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [94]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [95]:
string_data[0] = None

In [96]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [97]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [98]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [99]:
string_data.dropna()

0     aardvark
1    artichoke
3      avocado
dtype: object

In [102]:
from numpy import nan as NA

In [103]:
data = Series([1, NA, 3.5, NA, 7])

In [104]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [105]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [107]:
data[data.notnull()].dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [108]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],

[NA, NA, NA], [NA, 6.5, 3.]])

In [109]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [110]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [111]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [120]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [121]:
df = DataFrame(np.random.randn(7, 3))

In [122]:
df.iloc[:4,1]

0    0.010292
1   -1.416577
2   -1.486653
3   -0.243650
Name: 1, dtype: float64

In [123]:
df

          0         1         2
0  0.231419  0.010292 -0.046009
1 -1.128943 -1.416577  3.129602
2  0.000666 -1.486653  0.739513
3  0.154016 -0.243650  0.128838
4  0.465405 -0.832332  0.760023
5 -0.132623 -0.895254 -0.286540
6 -2.284219  0.214837 -2.271076

In [124]:
df.dropna(thresh=3)

          0         1         2
0  0.231419  0.010292 -0.046009
1 -1.128943 -1.416577  3.129602
2  0.000666 -1.486653  0.739513
3  0.154016 -0.243650  0.128838
4  0.465405 -0.832332  0.760023
5 -0.132623 -0.895254 -0.286540
6 -2.284219  0.214837 -2.271076

In [125]:
df

          0         1         2
0  0.231419  0.010292 -0.046009
1 -1.128943 -1.416577  3.129602
2  0.000666 -1.486653  0.739513
3  0.154016 -0.243650  0.128838
4  0.465405 -0.832332  0.760023
5 -0.132623 -0.895254 -0.286540
6 -2.284219  0.214837 -2.271076

In [126]:
df.fillna(0)

          0         1         2
0  0.231419  0.010292 -0.046009
1 -1.128943 -1.416577  3.129602
2  0.000666 -1.486653  0.739513
3  0.154016 -0.243650  0.128838
4  0.465405 -0.832332  0.760023
5 -0.132623 -0.895254 -0.286540
6 -2.284219  0.214837 -2.271076

In [127]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.231419  0.010292 -0.046009
1 -1.128943 -1.416577  3.129602
2  0.000666 -1.486653  0.739513
3  0.154016 -0.243650  0.128838
4  0.465405 -0.832332  0.760023
5 -0.132623 -0.895254 -0.286540
6 -2.284219  0.214837 -2.271076

In [128]:
_ = df.fillna(0, inplace=True)

In [129]:
df

          0         1         2
0  0.231419  0.010292 -0.046009
1 -1.128943 -1.416577  3.129602
2  0.000666 -1.486653  0.739513
3  0.154016 -0.243650  0.128838
4  0.465405 -0.832332  0.760023
5 -0.132623 -0.895254 -0.286540
6 -2.284219  0.214837 -2.271076

In [130]:
_

In [131]:
_

In [132]:
_ = df.fillna(0, inplace=True)

In [134]:
df

          0         1         2
0  0.231419  0.010292 -0.046009
1 -1.128943 -1.416577  3.129602
2  0.000666 -1.486653  0.739513
3  0.154016 -0.243650  0.128838
4  0.465405 -0.832332  0.760023
5 -0.132623 -0.895254 -0.286540
6 -2.284219  0.214837 -2.271076

In [135]:
df = DataFrame(np.random.randn(6, 3))

In [136]:
df

          0         1         2
0  0.988028  0.172779  0.958288
1  1.498273  1.368885  1.598554
2  0.248183  0.352707  0.318176
3  0.008344  0.033330  0.598130
4  1.312258 -0.055701  0.030382
5  0.301298  0.064643 -2.214896

In [137]:
df.fillna(method='ffill')

          0         1         2
0  0.988028  0.172779  0.958288
1  1.498273  1.368885  1.598554
2  0.248183  0.352707  0.318176
3  0.008344  0.033330  0.598130
4  1.312258 -0.055701  0.030382
5  0.301298  0.064643 -2.214896

In [138]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.988028  0.172779  0.958288
1  1.498273  1.368885  1.598554
2  0.248183  0.352707  0.318176
3  0.008344  0.033330  0.598130
4  1.312258 -0.055701  0.030382
5  0.301298  0.064643 -2.214896

In [139]:
data.fillna(data.mean())

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

In [141]:
data = Series(np.random.randn(10),

index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],

[1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [142]:
data

a  1   -1.307173
   2    0.267526
   3   -1.253198
b  1   -1.008997
   2    0.600254
   3    1.967928
c  1   -0.637152
   2   -0.203320
d  2   -0.501420
   3    0.967064
dtype: float64

In [143]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),

'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],

'd': [0, 1, 2, 0, 1, 2, 3]})

In [144]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [145]:
frame2 = frame.set_index(['c', 'd'])

In [146]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [147]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [148]:
ser = Series(np.arange(3.))

In [149]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [150]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [151]:
ser.iloc[:1]

0    0.0
dtype: float64

In [152]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [153]:
ser3

-5    0
 1    1
 3    2
dtype: int64

In [154]:
ser3.iget_value(2)

AttributeError: 'Series' object has no attribute 'iget_value'

In [156]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])

In [158]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [159]:
import pandas.io.data as web

ModuleNotFoundError: No module named 'pandas.io.data'